"use client"
import React from 'react'
import Accordion from './faq/Accordion'
import MoreQuestions from './faq/MoreQuestions';
import { motion } from "framer-motion";


const faqItems = [
  {
    id: 1,
    question: "რით განსხვავდება ინდივიდუალური ვარჯიში გუნდური ვარჯიშისგან?",
    answer:
      "გუნდში მწვრთნელის ყურადღება 20+ მოთამაშეზე ნაწილდება და აქცენტი ტაქტიკაზე კეთდება. ჩვენთან 100% ყურადღება ეთმობა კონკრეტულად თქვენი შვილის/თქვენს სუსტ წერტილებს, დეტალების დახვეწასა და ინდივიდუალურ ტექნიკას."
  },
  {
    id: 2,
    question: "რა ასაკობრივი ჯგუფებისთვის არის განკუთვნილი ვარჯიშები?",
    answer:
      "ჩვენ ვავარჯიშებთ ნებისმიერი დონის ფეხბურთელს, ჩვეულებრივ 6 წლიდან ზრდასრულ ასაკამდე. პროგრამა ერგება მოთამაშის ინდივიდუალურ მონაცემებსა და ასაკობრივ თავისებურებებს."
  },
  {
    id: 3,
    question: "ავარჯიშებთ თუ არა კონკრეტული სათამაშო პოზიციის მიხედვით?",
    answer:
      "დიახ. მცველებს, ნახევარმცველებსა და თავდამსხმელებს სრულიად განსხვავებული სპეციფიკური უნარები სჭირდებათ. ვარჯიშები იგეგმება იმ სათამაშო პოზიციის გათვალისწინებით, სადაც ფეხბურთელი მოედანზე ასპარეზობს."
  },
  {
    id: 4,
    question: "ხომ არ გადაიღლება ფეხბურთელი, თუ პარალელურად გუნდშიც ვარჯიშობს?",
    answer:
      "არა, რადგან ჩვენი ინდივიდუალური გეგმა იწყობა მოთამაშის გუნდური განრიგისა და თამაშების მიხედვით. დატვირთვები ისე რეგულირდება, რომ თავიდან ავირიდოთ გადაღლა და პირიქით — ხელი შევუწყოთ სწორ აღდგენას."
  },
  {
    id: 5,
    question: "რამდენი ხანი გრძელდება ერთი სავარჯიშო სესია?",
    answer:
      "ერთი ინდივიდუალური ვარჯიშის ხანგრძლივობა შეადგენს 60-იდან 90 წუთამდე. ეს დრო მოიცავს გახურებას, ძირითად ტექნიკურ/ფიზიკურ დატვირთვას და ვარჯიშის შემდგომ აღდგენით (Stretching) ვარჯიშებს."
  },
  {
    id: 6,
    question: "რა უნდა ვიქონიო თან ვარჯიშზე მოსვლისას?",
    answer:
      "თან უნდა გქონდეთ სპორტული ფორმა (ბუცები/მრავალწვეტიანი ბუცები საფარის მიხედვით), ინდივიდუალური წყლის ბოთლი და პოზიტიური განწყობა. დანარჩენი ყველა პროფესიონალური ინვენტარით ვუზრუნველყოფთ ჩვენ."
  },
  {
    id: 7,
    question: "რა ხდება, თუ ფეხბურთელს ვარჯიშის გაცდენა მოუწია?",
    answer:
      "ვარჯიშის გაცდენის შესახებ მინიმუმ რამდენიმე საათით ან დღით ადრე შეატყობინეთ მწვრთნელს, სესია არ იკარგება და გადადის თქვენთვის მოსახერხებელ სხვა დროზე."
  },
  {
    id: 8,
    question: "როგორ შემიძლია ვარჯიშზე ჩაწერა ან ჯავშნის გაკეთება?",
    answer:
      "ვარჯიშზე ჩასაწერად შეგიძლიათ შეავსოთ საიტზე არსებული სარეგისტრაციო ფორმა, ან პირდაპირ დაგვიკავშირდეთ მითითებულ ნომერზე / სოციალურ ქსელებში. ჩვენ შევარჩევთ თქვენთვის მოსახერხებელ დროსა და გრაფიკს."
  }
];



const Faq = () => {
  return (
    <section id='faq' className='mt-0 md:mt-30 mb-20 px-5 lg:px-15 xl:px-5   max-w-380 w-full mx-auto overflow-x-clip'>
      <div className="flex flex-col items-start gap-6 md:mt-18 max-lg:max-w-165 w-full mx-auto">
        <motion.h2 
         initial={{ opacity: 0, y: 70 }}
            whileInView={{ opacity: 1, y: 0 }}
            viewport={{ once: true, amount: 0.3 }}
            transition={{
              duration: 0.7,
              ease: "easeOut",
            }}
        className='text-gray-500 uppercase  text-4xl md:text-6xl  mb-5 font-hakuna'>
            ხშირად დასმული <br/> <span className='text-black'>კითხვები</span>
        </motion.h2>
        <div className=' flex gap-5  flex-col items-center lg:flex-row lg:justify-between lg:gap-15'>
        <Accordion accordionItems={faqItems} />
        <MoreQuestions />
        </div>
        </div>
    </section>
  )
}

export default Faq